tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Applications
cask "alacritty" # My GPU editor
cask "docker" # Docker Desktop
cask "postman" # HTTP client
cask "spotify" # Music
cask "visual-studio-code" # Just in case
cask "postico" # Postgres client
cask "slack" # Chat app
cask "zoom" # Voice app
cask "discord" # Voice and Chat app
cask "krisp" # Removes noise from mic
cask "notion" # Note taking app
cask "rectangle" # Windows Snap (Needs setup after installation)

# CLI Applications
brew "asdf" # echo -e "\n. $(brew --prefix asdf)/asdf.sh" >> ~/.zshrc
brew "git" # Version control
brew "openssl"
brew "macvim" # Full version of vim. See https://github.com/macvim-dev/macvim/blob/master/README_vim.md
brew "postgresql" # CLI for postgres
brew "the_silver_searcher"
brew "tmux" # Terminal goodness
brew "yarn" # NPM package manager
brew "coreutils"

